---
kind: type
id: T:Autodesk.Revit.DB.SpatialElementBoundarySubface
source: html/0a8f3677-3320-a8a5-674e-b0d055ac6671.htm
---
# Autodesk.Revit.DB.SpatialElementBoundarySubface

SpatialElementBoundarySubface represents the geometry boundary information of spatial element.

## Syntax (C#)
```csharp
public class SpatialElementBoundarySubface : IDisposable
```